GopalSaraf/Practicals/PSDL/include/proc/pic16lf18875.inc
// Register: CRCSHIFTH
#define CRCSHIFTH CRCSHIFTH
CRCSHIFTH                                equ 041Bh
// bitfield definitions
CRCSHIFTH_SHFT8_POSN                     equ 0000h
CRCSHIFTH_SHFT8_POSITION                 equ 0000h
CRCSHIFTH_SHFT8_SIZE                     equ 0001h
CRCSHIFTH_SHFT8_LENGTH                   equ 0001h
CRCSHIFTH_SHFT8_MASK                     equ 0001h
CRCSHIFTH_SHFT9_POSN                     equ 0001h
CRCSHIFTH_SHFT9_POSITION                 equ 0001h
CRCSHIFTH_SHFT9_SIZE                     equ 0001h
CRCSHIFTH_SHFT9_LENGTH                   equ 0001h
CRCSHIFTH_SHFT9_MASK                     equ 0002h
CRCSHIFTH_SHFT10_POSN                    equ 0002h
CRCSHIFTH_SHFT10_POSITION                equ 0002h
CRCSHIFTH_SHFT10_SIZE                    equ 0001h
CRCSHIFTH_SHFT10_LENGTH                  equ 0001h
CRCSHIFTH_SHFT10_MASK                    equ 0004h
CRCSHIFTH_SHFT11_POSN                    equ 0003h
CRCSHIFTH_SHFT11_POSITION                equ 0003h
CRCSHIFTH_SHFT11_SIZE                    equ 0001h
CRCSHIFTH_SHFT11_LENGTH                  equ 0001h
CRCSHIFTH_SHFT11_MASK                    equ 0008h
CRCSHIFTH_SHFT12_POSN                    equ 0004h
CRCSHIFTH_SHFT12_POSITION                equ 0004h
CRCSHIFTH_SHFT12_SIZE                    equ 0001h
CRCSHIFTH_SHFT12_LENGTH                  equ 0001h
CRCSHIFTH_SHFT12_MASK                    equ 0010h
CRCSHIFTH_SHFT13_POSN                    equ 0005h
CRCSHIFTH_SHFT13_POSITION                equ 0005h
CRCSHIFTH_SHFT13_SIZE                    equ 0001h
CRCSHIFTH_SHFT13_LENGTH                  equ 0001h
CRCSHIFTH_SHFT13_MASK                    equ 0020h
CRCSHIFTH_SHFT14_POSN                    equ 0006h
CRCSHIFTH_SHFT14_POSITION                equ 0006h
CRCSHIFTH_SHFT14_SIZE                    equ 0001h
CRCSHIFTH_SHFT14_LENGTH                  equ 0001h
CRCSHIFTH_SHFT14_MASK                    equ 0040h
CRCSHIFTH_SHFT15_POSN                    equ 0007h
CRCSHIFTH_SHFT15_POSITION                equ 0007h
CRCSHIFTH_SHFT15_SIZE                    equ 0001h
CRCSHIFTH_SHFT15_LENGTH                  equ 0001h
CRCSHIFTH_SHFT15_MASK                    equ 0080h

// Register: CRCXORL
#define CRCXORL CRCXORL
CRCXORL                                  equ 041Ch
// bitfield definitions
CRCXORL_X1_POSN                          equ 0001h
CRCXORL_X1_POSITION                      equ 0001h
CRCXORL_X1_SIZE                          equ 0001h
CRCXORL_X1_LENGTH                        equ 0001h
CRCXORL_X1_MASK                          equ 0002h
CRCXORL_X2_POSN                          equ 0002h
CRCXORL_X2_POSITION                      equ 0002h
CRCXORL_X2_SIZE                          equ 0001h
CRCXORL_X2_LENGTH                        equ 0001h
CRCXORL_X2_MASK                          equ 0004h
CRCXORL_X3_POSN                          equ 0003h
CRCXORL_X3_POSITION                      equ 0003h
CRCXORL_X3_SIZE                          equ 0001h
CRCXORL_X3_LENGTH                        equ 0001h
CRCXORL_X3_MASK                          equ 0008h
CRCXORL_X4_POSN                          equ 0004h
CRCXORL_X4_POSITION                      equ 0004h
CRCXORL_X4_SIZE                          equ 0001h
CRCXORL_X4_LENGTH                        equ 0001h
CRCXORL_X4_MASK                          equ 0010h
CRCXORL_X5_POSN                          equ 0005h
CRCXORL_X5_POSITION                      equ 0005h
CRCXORL_X5_SIZE                          equ 0001h
CRCXORL_X5_LENGTH                        equ 0001h
CRCXORL_X5_MASK                          equ 0020h
CRCXORL_X6_POSN                          equ 0006h
CRCXORL_X6_POSITION                      equ 0006h
CRCXORL_X6_SIZE                          equ 0001h
CRCXORL_X6_LENGTH                        equ 0001h
CRCXORL_X6_MASK                          equ 0040h
CRCXORL_X7_POSN                          equ 0007h
CRCXORL_X7_POSITION                      equ 0007h
CRCXORL_X7_SIZE                          equ 0001h
CRCXORL_X7_LENGTH                        equ 0001h
CRCXORL_X7_MASK                          equ 0080h

// Register: CRCXORH
#define CRCXORH CRCXORH
CRCXORH                                  equ 041Dh
// bitfield definitions
CRCXORH_X8_POSN                          equ 0000h
CRCXORH_X8_POSITION                      equ 0000h
CRCXORH_X8_SIZE                          equ 0001h
CRCXORH_X8_LENGTH                        equ 0001h
CRCXORH_X8_MASK                          equ 0001h
CRCXORH_X9_POSN                          equ 0001h
CRCXORH_X9_POSITION                      equ 0001h
CRCXORH_X9_SIZE                          equ 0001h
CRCXORH_X9_LENGTH                        equ 0001h
CRCXORH_X9_MASK                          equ 0002h
CRCXORH_X10_POSN                         equ 0002h
CRCXORH_X10_POSITION                     equ 0002h
CRCXORH_X10_SIZE                         equ 0001h
CRCXORH_X10_LENGTH                       equ 0001h
CRCXORH_X10_MASK                         equ 0004h
CRCXORH_X11_POSN                         equ 0003h
CRCXORH_X11_POSITION                     equ 0003h
CRCXORH_X11_SIZE                         equ 0001h
CRCXORH_X11_LENGTH                       equ 0001h
CRCXORH_X11_MASK                         equ 0008h
CRCXORH_X12_POSN                         equ 0004h
CRCXORH_X12_POSITION                     equ 0004h
CRCXORH_X12_SIZE                         equ 0001h
CRCXORH_X12_LENGTH                       equ 0001h
CRCXORH_X12_MASK                         equ 0010h
CRCXORH_X13_POSN                         equ 0005h
CRCXORH_X13_POSITION                     equ 0005h
CRCXORH_X13_SIZE                         equ 0001h
CRCXORH_X13_LENGTH                       equ 0001h
CRCXORH_X13_MASK                         equ 0020h
CRCXORH_X14_POSN                         equ 0006h
CRCXORH_X14_POSITION                     equ 0006h
CRCXORH_X14_SIZE                         equ 0001h
CRCXORH_X14_LENGTH                       equ 0001h
CRCXORH_X14_MASK                         equ 0040h
CRCXORH_X15_POSN                         equ 0007h
CRCXORH_X15_POSITION                     equ 0007h
CRCXORH_X15_SIZE                         equ 0001h
CRCXORH_X15_LENGTH                       equ 0001h
CRCXORH_X15_MASK                         equ 0080h

// Register: CRCCON0
#define CRCCON0 CRCCON0
CRCCON0                                  equ 041Eh
// bitfield definitions
CRCCON0_FULL_POSN                        equ 0000h
CRCCON0_FULL_POSITION                    equ 0000h
CRCCON0_FULL_SIZE                        equ 0001h
CRCCON0_FULL_LENGTH                      equ 0001h
CRCCON0_FULL_MASK                        equ 0001h
CRCCON0_SHIFTM_POSN                      equ 0001h
CRCCON0_SHIFTM_POSITION                  equ 0001h
CRCCON0_SHIFTM_SIZE                      equ 0001h
CRCCON0_SHIFTM_LENGTH                    equ 0001h
CRCCON0_SHIFTM_MASK                      equ 0002h
CRCCON0_ACCM_POSN                        equ 0004h
CRCCON0_ACCM_POSITION                    equ 0004h
CRCCON0_ACCM_SIZE                        equ 0001h
CRCCON0_ACCM_LENGTH                      equ 0001h
CRCCON0_ACCM_MASK                        equ 0010h
CRCCON0_BUSY_POSN                        equ 0005h
CRCCON0_BUSY_POSITION                    equ 0005h
CRCCON0_BUSY_SIZE                        equ 0001h
CRCCON0_BUSY_LENGTH                      equ 0001h
CRCCON0_BUSY_MASK                        equ 0020h
CRCCON0_CRCGO_POSN                       equ 0006h
CRCCON0_CRCGO_POSITION                   equ 0006h
CRCCON0_CRCGO_SIZE                       equ 0001h
CRCCON0_CRCGO_LENGTH                     equ 0001h
CRCCON0_CRCGO_MASK                       equ 0040h
CRCCON0_EN_POSN                          equ 0007h
CRCCON0_EN_POSITION                      equ 0007h
CRCCON0_EN_SIZE                          equ 0001h
CRCCON0_EN_LENGTH                        equ 0001h
CRCCON0_EN_MASK                          equ 0080h
CRCCON0_CRCEN_POSN                       equ 0007h
CRCCON0_CRCEN_POSITION                   equ 0007h
CRCCON0_CRCEN_SIZE                       equ 0001h
CRCCON0_CRCEN_LENGTH                     equ 0001h
CRCCON0_CRCEN_MASK                       equ 0080h

