GopalSaraf/Practicals/PSDL/include/proc/pic16lf18875.inc
// Register: SMT2TMRU
#define SMT2TMRU SMT2TMRU
SMT2TMRU                                 equ 050Eh
// bitfield definitions
SMT2TMRU_TMR_POSN                        equ 0000h
SMT2TMRU_TMR_POSITION                    equ 0000h
SMT2TMRU_TMR_SIZE                        equ 0008h
SMT2TMRU_TMR_LENGTH                      equ 0008h
SMT2TMRU_TMR_MASK                        equ 00FFh
SMT2TMRU_TMR16_POSN                      equ 0000h
SMT2TMRU_TMR16_POSITION                  equ 0000h
SMT2TMRU_TMR16_SIZE                      equ 0001h
SMT2TMRU_TMR16_LENGTH                    equ 0001h
SMT2TMRU_TMR16_MASK                      equ 0001h
SMT2TMRU_TMR17_POSN                      equ 0001h
SMT2TMRU_TMR17_POSITION                  equ 0001h
SMT2TMRU_TMR17_SIZE                      equ 0001h
SMT2TMRU_TMR17_LENGTH                    equ 0001h
SMT2TMRU_TMR17_MASK                      equ 0002h
SMT2TMRU_TMR18_POSN                      equ 0002h
SMT2TMRU_TMR18_POSITION                  equ 0002h
SMT2TMRU_TMR18_SIZE                      equ 0001h
SMT2TMRU_TMR18_LENGTH                    equ 0001h
SMT2TMRU_TMR18_MASK                      equ 0004h
SMT2TMRU_TMR19_POSN                      equ 0003h
SMT2TMRU_TMR19_POSITION                  equ 0003h
SMT2TMRU_TMR19_SIZE                      equ 0001h
SMT2TMRU_TMR19_LENGTH                    equ 0001h
SMT2TMRU_TMR19_MASK                      equ 0008h
SMT2TMRU_TMR20_POSN                      equ 0004h
SMT2TMRU_TMR20_POSITION                  equ 0004h
SMT2TMRU_TMR20_SIZE                      equ 0001h
SMT2TMRU_TMR20_LENGTH                    equ 0001h
SMT2TMRU_TMR20_MASK                      equ 0010h
SMT2TMRU_TMR21_POSN                      equ 0005h
SMT2TMRU_TMR21_POSITION                  equ 0005h
SMT2TMRU_TMR21_SIZE                      equ 0001h
SMT2TMRU_TMR21_LENGTH                    equ 0001h
SMT2TMRU_TMR21_MASK                      equ 0020h
SMT2TMRU_TMR22_POSN                      equ 0006h
SMT2TMRU_TMR22_POSITION                  equ 0006h
SMT2TMRU_TMR22_SIZE                      equ 0001h
SMT2TMRU_TMR22_LENGTH                    equ 0001h
SMT2TMRU_TMR22_MASK                      equ 0040h
SMT2TMRU_TMR23_POSN                      equ 0007h
SMT2TMRU_TMR23_POSITION                  equ 0007h
SMT2TMRU_TMR23_SIZE                      equ 0001h
SMT2TMRU_TMR23_LENGTH                    equ 0001h
SMT2TMRU_TMR23_MASK                      equ 0080h
SMT2TMRU_SMT2TMR_POSN                    equ 0000h
SMT2TMRU_SMT2TMR_POSITION                equ 0000h
SMT2TMRU_SMT2TMR_SIZE                    equ 0008h
SMT2TMRU_SMT2TMR_LENGTH                  equ 0008h
SMT2TMRU_SMT2TMR_MASK                    equ 00FFh
SMT2TMRU_SMT2TMR16_POSN                  equ 0000h
SMT2TMRU_SMT2TMR16_POSITION              equ 0000h
SMT2TMRU_SMT2TMR16_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR16_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR16_MASK                  equ 0001h
SMT2TMRU_SMT2TMR17_POSN                  equ 0001h
SMT2TMRU_SMT2TMR17_POSITION              equ 0001h
SMT2TMRU_SMT2TMR17_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR17_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR17_MASK                  equ 0002h
SMT2TMRU_SMT2TMR18_POSN                  equ 0002h
SMT2TMRU_SMT2TMR18_POSITION              equ 0002h
SMT2TMRU_SMT2TMR18_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR18_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR18_MASK                  equ 0004h
SMT2TMRU_SMT2TMR19_POSN                  equ 0003h
SMT2TMRU_SMT2TMR19_POSITION              equ 0003h
SMT2TMRU_SMT2TMR19_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR19_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR19_MASK                  equ 0008h
SMT2TMRU_SMT2TMR20_POSN                  equ 0004h
SMT2TMRU_SMT2TMR20_POSITION              equ 0004h
SMT2TMRU_SMT2TMR20_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR20_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR20_MASK                  equ 0010h
SMT2TMRU_SMT2TMR21_POSN                  equ 0005h
SMT2TMRU_SMT2TMR21_POSITION              equ 0005h
SMT2TMRU_SMT2TMR21_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR21_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR21_MASK                  equ 0020h
SMT2TMRU_SMT2TMR22_POSN                  equ 0006h
SMT2TMRU_SMT2TMR22_POSITION              equ 0006h
SMT2TMRU_SMT2TMR22_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR22_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR22_MASK                  equ 0040h
SMT2TMRU_SMT2TMR23_POSN                  equ 0007h
SMT2TMRU_SMT2TMR23_POSITION              equ 0007h
SMT2TMRU_SMT2TMR23_SIZE                  equ 0001h
SMT2TMRU_SMT2TMR23_LENGTH                equ 0001h
SMT2TMRU_SMT2TMR23_MASK                  equ 0080h

// Register: SMT2CPRL
#define SMT2CPRL SMT2CPRL
SMT2CPRL                                 equ 050Fh
// bitfield definitions
SMT2CPRL_CPR_POSN                        equ 0000h
SMT2CPRL_CPR_POSITION                    equ 0000h
SMT2CPRL_CPR_SIZE                        equ 0008h
SMT2CPRL_CPR_LENGTH                      equ 0008h
SMT2CPRL_CPR_MASK                        equ 00FFh
SMT2CPRL_CPR0_POSN                       equ 0000h
SMT2CPRL_CPR0_POSITION                   equ 0000h
SMT2CPRL_CPR0_SIZE                       equ 0001h
SMT2CPRL_CPR0_LENGTH                     equ 0001h
SMT2CPRL_CPR0_MASK                       equ 0001h
SMT2CPRL_CPR1_POSN                       equ 0001h
SMT2CPRL_CPR1_POSITION                   equ 0001h
SMT2CPRL_CPR1_SIZE                       equ 0001h
SMT2CPRL_CPR1_LENGTH                     equ 0001h
SMT2CPRL_CPR1_MASK                       equ 0002h
SMT2CPRL_CPR2_POSN                       equ 0002h
SMT2CPRL_CPR2_POSITION                   equ 0002h
SMT2CPRL_CPR2_SIZE                       equ 0001h
SMT2CPRL_CPR2_LENGTH                     equ 0001h
SMT2CPRL_CPR2_MASK                       equ 0004h
SMT2CPRL_CPR3_POSN                       equ 0003h
SMT2CPRL_CPR3_POSITION                   equ 0003h
SMT2CPRL_CPR3_SIZE                       equ 0001h
SMT2CPRL_CPR3_LENGTH                     equ 0001h
SMT2CPRL_CPR3_MASK                       equ 0008h
SMT2CPRL_CPR4_POSN                       equ 0004h
SMT2CPRL_CPR4_POSITION                   equ 0004h
SMT2CPRL_CPR4_SIZE                       equ 0001h
SMT2CPRL_CPR4_LENGTH                     equ 0001h
SMT2CPRL_CPR4_MASK                       equ 0010h
SMT2CPRL_CPR5_POSN                       equ 0005h
SMT2CPRL_CPR5_POSITION                   equ 0005h
SMT2CPRL_CPR5_SIZE                       equ 0001h
SMT2CPRL_CPR5_LENGTH                     equ 0001h
SMT2CPRL_CPR5_MASK                       equ 0020h
SMT2CPRL_CPR6_POSN                       equ 0006h
SMT2CPRL_CPR6_POSITION                   equ 0006h
SMT2CPRL_CPR6_SIZE                       equ 0001h
SMT2CPRL_CPR6_LENGTH                     equ 0001h
SMT2CPRL_CPR6_MASK                       equ 0040h
SMT2CPRL_CPR7_POSN                       equ 0007h
SMT2CPRL_CPR7_POSITION                   equ 0007h
SMT2CPRL_CPR7_SIZE                       equ 0001h
SMT2CPRL_CPR7_LENGTH                     equ 0001h
SMT2CPRL_CPR7_MASK                       equ 0080h
SMT2CPRL_SMT2CPR_POSN                    equ 0000h
SMT2CPRL_SMT2CPR_POSITION                equ 0000h
SMT2CPRL_SMT2CPR_SIZE                    equ 0008h
SMT2CPRL_SMT2CPR_LENGTH                  equ 0008h
SMT2CPRL_SMT2CPR_MASK                    equ 00FFh
SMT2CPRL_SMT2CPR0_POSN                   equ 0000h
SMT2CPRL_SMT2CPR0_POSITION               equ 0000h
SMT2CPRL_SMT2CPR0_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR0_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR0_MASK                   equ 0001h
SMT2CPRL_SMT2CPR1_POSN                   equ 0001h
SMT2CPRL_SMT2CPR1_POSITION               equ 0001h
SMT2CPRL_SMT2CPR1_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR1_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR1_MASK                   equ 0002h
SMT2CPRL_SMT2CPR2_POSN                   equ 0002h
SMT2CPRL_SMT2CPR2_POSITION               equ 0002h
SMT2CPRL_SMT2CPR2_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR2_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR2_MASK                   equ 0004h
SMT2CPRL_SMT2CPR3_POSN                   equ 0003h
SMT2CPRL_SMT2CPR3_POSITION               equ 0003h
SMT2CPRL_SMT2CPR3_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR3_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR3_MASK                   equ 0008h
SMT2CPRL_SMT2CPR4_POSN                   equ 0004h
SMT2CPRL_SMT2CPR4_POSITION               equ 0004h
SMT2CPRL_SMT2CPR4_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR4_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR4_MASK                   equ 0010h
SMT2CPRL_SMT2CPR5_POSN                   equ 0005h
SMT2CPRL_SMT2CPR5_POSITION               equ 0005h
SMT2CPRL_SMT2CPR5_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR5_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR5_MASK                   equ 0020h
SMT2CPRL_SMT2CPR6_POSN                   equ 0006h
SMT2CPRL_SMT2CPR6_POSITION               equ 0006h
SMT2CPRL_SMT2CPR6_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR6_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR6_MASK                   equ 0040h
SMT2CPRL_SMT2CPR7_POSN                   equ 0007h
SMT2CPRL_SMT2CPR7_POSITION               equ 0007h
SMT2CPRL_SMT2CPR7_SIZE                   equ 0001h
SMT2CPRL_SMT2CPR7_LENGTH                 equ 0001h
SMT2CPRL_SMT2CPR7_MASK                   equ 0080h

