GopalSaraf/Practicals/PSDL/include/proc/pic16lf18875.inc
// Register: CLC4SEL1
#define CLC4SEL1 CLC4SEL1
CLC4SEL1                                 equ 0E31h
// bitfield definitions
CLC4SEL1_LC4D2S0_POSN                    equ 0000h
CLC4SEL1_LC4D2S0_POSITION                equ 0000h
CLC4SEL1_LC4D2S0_SIZE                    equ 0001h
CLC4SEL1_LC4D2S0_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S0_MASK                    equ 0001h
CLC4SEL1_LC4D2S1_POSN                    equ 0001h
CLC4SEL1_LC4D2S1_POSITION                equ 0001h
CLC4SEL1_LC4D2S1_SIZE                    equ 0001h
CLC4SEL1_LC4D2S1_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S1_MASK                    equ 0002h
CLC4SEL1_LC4D2S2_POSN                    equ 0002h
CLC4SEL1_LC4D2S2_POSITION                equ 0002h
CLC4SEL1_LC4D2S2_SIZE                    equ 0001h
CLC4SEL1_LC4D2S2_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S2_MASK                    equ 0004h
CLC4SEL1_LC4D2S3_POSN                    equ 0003h
CLC4SEL1_LC4D2S3_POSITION                equ 0003h
CLC4SEL1_LC4D2S3_SIZE                    equ 0001h
CLC4SEL1_LC4D2S3_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S3_MASK                    equ 0008h
CLC4SEL1_LC4D2S4_POSN                    equ 0004h
CLC4SEL1_LC4D2S4_POSITION                equ 0004h
CLC4SEL1_LC4D2S4_SIZE                    equ 0001h
CLC4SEL1_LC4D2S4_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S4_MASK                    equ 0010h
CLC4SEL1_LC4D2S5_POSN                    equ 0005h
CLC4SEL1_LC4D2S5_POSITION                equ 0005h
CLC4SEL1_LC4D2S5_SIZE                    equ 0001h
CLC4SEL1_LC4D2S5_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S5_MASK                    equ 0020h
CLC4SEL1_LC4D2S6_POSN                    equ 0006h
CLC4SEL1_LC4D2S6_POSITION                equ 0006h
CLC4SEL1_LC4D2S6_SIZE                    equ 0001h
CLC4SEL1_LC4D2S6_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S6_MASK                    equ 0040h
CLC4SEL1_LC4D2S7_POSN                    equ 0007h
CLC4SEL1_LC4D2S7_POSITION                equ 0007h
CLC4SEL1_LC4D2S7_SIZE                    equ 0001h
CLC4SEL1_LC4D2S7_LENGTH                  equ 0001h
CLC4SEL1_LC4D2S7_MASK                    equ 0080h
CLC4SEL1_LC4D2S_POSN                     equ 0000h
CLC4SEL1_LC4D2S_POSITION                 equ 0000h
CLC4SEL1_LC4D2S_SIZE                     equ 0008h
CLC4SEL1_LC4D2S_LENGTH                   equ 0008h
CLC4SEL1_LC4D2S_MASK                     equ 00FFh
CLC4SEL1_D2S_POSN                        equ 0000h
CLC4SEL1_D2S_POSITION                    equ 0000h
CLC4SEL1_D2S_SIZE                        equ 0008h
CLC4SEL1_D2S_LENGTH                      equ 0008h
CLC4SEL1_D2S_MASK                        equ 00FFh
CLC4SEL1_D2S0_POSN                       equ 0000h
CLC4SEL1_D2S0_POSITION                   equ 0000h
CLC4SEL1_D2S0_SIZE                       equ 0001h
CLC4SEL1_D2S0_LENGTH                     equ 0001h
CLC4SEL1_D2S0_MASK                       equ 0001h
CLC4SEL1_D2S1_POSN                       equ 0001h
CLC4SEL1_D2S1_POSITION                   equ 0001h
CLC4SEL1_D2S1_SIZE                       equ 0001h
CLC4SEL1_D2S1_LENGTH                     equ 0001h
CLC4SEL1_D2S1_MASK                       equ 0002h
CLC4SEL1_D2S2_POSN                       equ 0002h
CLC4SEL1_D2S2_POSITION                   equ 0002h
CLC4SEL1_D2S2_SIZE                       equ 0001h
CLC4SEL1_D2S2_LENGTH                     equ 0001h
CLC4SEL1_D2S2_MASK                       equ 0004h
CLC4SEL1_D2S3_POSN                       equ 0003h
CLC4SEL1_D2S3_POSITION                   equ 0003h
CLC4SEL1_D2S3_SIZE                       equ 0001h
CLC4SEL1_D2S3_LENGTH                     equ 0001h
CLC4SEL1_D2S3_MASK                       equ 0008h
CLC4SEL1_D2S4_POSN                       equ 0004h
CLC4SEL1_D2S4_POSITION                   equ 0004h
CLC4SEL1_D2S4_SIZE                       equ 0001h
CLC4SEL1_D2S4_LENGTH                     equ 0001h
CLC4SEL1_D2S4_MASK                       equ 0010h
CLC4SEL1_D2S5_POSN                       equ 0005h
CLC4SEL1_D2S5_POSITION                   equ 0005h
CLC4SEL1_D2S5_SIZE                       equ 0001h
CLC4SEL1_D2S5_LENGTH                     equ 0001h
CLC4SEL1_D2S5_MASK                       equ 0020h
CLC4SEL1_D2S6_POSN                       equ 0006h
CLC4SEL1_D2S6_POSITION                   equ 0006h
CLC4SEL1_D2S6_SIZE                       equ 0001h
CLC4SEL1_D2S6_LENGTH                     equ 0001h
CLC4SEL1_D2S6_MASK                       equ 0040h
CLC4SEL1_D2S7_POSN                       equ 0007h
CLC4SEL1_D2S7_POSITION                   equ 0007h
CLC4SEL1_D2S7_SIZE                       equ 0001h
CLC4SEL1_D2S7_LENGTH                     equ 0001h
CLC4SEL1_D2S7_MASK                       equ 0080h

// Register: CLC4SEL2
#define CLC4SEL2 CLC4SEL2
CLC4SEL2                                 equ 0E32h
// bitfield definitions
CLC4SEL2_LC4D3S0_POSN                    equ 0000h
CLC4SEL2_LC4D3S0_POSITION                equ 0000h
CLC4SEL2_LC4D3S0_SIZE                    equ 0001h
CLC4SEL2_LC4D3S0_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S0_MASK                    equ 0001h
CLC4SEL2_LC4D3S1_POSN                    equ 0001h
CLC4SEL2_LC4D3S1_POSITION                equ 0001h
CLC4SEL2_LC4D3S1_SIZE                    equ 0001h
CLC4SEL2_LC4D3S1_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S1_MASK                    equ 0002h
CLC4SEL2_LC4D3S2_POSN                    equ 0002h
CLC4SEL2_LC4D3S2_POSITION                equ 0002h
CLC4SEL2_LC4D3S2_SIZE                    equ 0001h
CLC4SEL2_LC4D3S2_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S2_MASK                    equ 0004h
CLC4SEL2_LC4D3S3_POSN                    equ 0003h
CLC4SEL2_LC4D3S3_POSITION                equ 0003h
CLC4SEL2_LC4D3S3_SIZE                    equ 0001h
CLC4SEL2_LC4D3S3_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S3_MASK                    equ 0008h
CLC4SEL2_LC4D3S4_POSN                    equ 0004h
CLC4SEL2_LC4D3S4_POSITION                equ 0004h
CLC4SEL2_LC4D3S4_SIZE                    equ 0001h
CLC4SEL2_LC4D3S4_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S4_MASK                    equ 0010h
CLC4SEL2_LC4D3S5_POSN                    equ 0005h
CLC4SEL2_LC4D3S5_POSITION                equ 0005h
CLC4SEL2_LC4D3S5_SIZE                    equ 0001h
CLC4SEL2_LC4D3S5_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S5_MASK                    equ 0020h
CLC4SEL2_LC4D3S6_POSN                    equ 0006h
CLC4SEL2_LC4D3S6_POSITION                equ 0006h
CLC4SEL2_LC4D3S6_SIZE                    equ 0001h
CLC4SEL2_LC4D3S6_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S6_MASK                    equ 0040h
CLC4SEL2_LC4D3S7_POSN                    equ 0007h
CLC4SEL2_LC4D3S7_POSITION                equ 0007h
CLC4SEL2_LC4D3S7_SIZE                    equ 0001h
CLC4SEL2_LC4D3S7_LENGTH                  equ 0001h
CLC4SEL2_LC4D3S7_MASK                    equ 0080h
CLC4SEL2_LC4D3S_POSN                     equ 0000h
CLC4SEL2_LC4D3S_POSITION                 equ 0000h
CLC4SEL2_LC4D3S_SIZE                     equ 0008h
CLC4SEL2_LC4D3S_LENGTH                   equ 0008h
CLC4SEL2_LC4D3S_MASK                     equ 00FFh
CLC4SEL2_D3S_POSN                        equ 0000h
CLC4SEL2_D3S_POSITION                    equ 0000h
CLC4SEL2_D3S_SIZE                        equ 0008h
CLC4SEL2_D3S_LENGTH                      equ 0008h
CLC4SEL2_D3S_MASK                        equ 00FFh
CLC4SEL2_D3S0_POSN                       equ 0000h
CLC4SEL2_D3S0_POSITION                   equ 0000h
CLC4SEL2_D3S0_SIZE                       equ 0001h
CLC4SEL2_D3S0_LENGTH                     equ 0001h
CLC4SEL2_D3S0_MASK                       equ 0001h
CLC4SEL2_D3S1_POSN                       equ 0001h
CLC4SEL2_D3S1_POSITION                   equ 0001h
CLC4SEL2_D3S1_SIZE                       equ 0001h
CLC4SEL2_D3S1_LENGTH                     equ 0001h
CLC4SEL2_D3S1_MASK                       equ 0002h
CLC4SEL2_D3S2_POSN                       equ 0002h
CLC4SEL2_D3S2_POSITION                   equ 0002h
CLC4SEL2_D3S2_SIZE                       equ 0001h
CLC4SEL2_D3S2_LENGTH                     equ 0001h
CLC4SEL2_D3S2_MASK                       equ 0004h
CLC4SEL2_D3S3_POSN                       equ 0003h
CLC4SEL2_D3S3_POSITION                   equ 0003h
CLC4SEL2_D3S3_SIZE                       equ 0001h
CLC4SEL2_D3S3_LENGTH                     equ 0001h
CLC4SEL2_D3S3_MASK                       equ 0008h
CLC4SEL2_D3S4_POSN                       equ 0004h
CLC4SEL2_D3S4_POSITION                   equ 0004h
CLC4SEL2_D3S4_SIZE                       equ 0001h
CLC4SEL2_D3S4_LENGTH                     equ 0001h
CLC4SEL2_D3S4_MASK                       equ 0010h
CLC4SEL2_D3S5_POSN                       equ 0005h
CLC4SEL2_D3S5_POSITION                   equ 0005h
CLC4SEL2_D3S5_SIZE                       equ 0001h
CLC4SEL2_D3S5_LENGTH                     equ 0001h
CLC4SEL2_D3S5_MASK                       equ 0020h
CLC4SEL2_D3S6_POSN                       equ 0006h
CLC4SEL2_D3S6_POSITION                   equ 0006h
CLC4SEL2_D3S6_SIZE                       equ 0001h
CLC4SEL2_D3S6_LENGTH                     equ 0001h
CLC4SEL2_D3S6_MASK                       equ 0040h
CLC4SEL2_D3S7_POSN                       equ 0007h
CLC4SEL2_D3S7_POSITION                   equ 0007h
CLC4SEL2_D3S7_SIZE                       equ 0001h
CLC4SEL2_D3S7_LENGTH                     equ 0001h
CLC4SEL2_D3S7_MASK                       equ 0080h

// Register: CLC4SEL3
#define CLC4SEL3 CLC4SEL3
CLC4SEL3                                 equ 0E33h
// bitfield definitions
CLC4SEL3_LC4D4S0_POSN                    equ 0000h
CLC4SEL3_LC4D4S0_POSITION                equ 0000h
CLC4SEL3_LC4D4S0_SIZE                    equ 0001h
CLC4SEL3_LC4D4S0_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S0_MASK                    equ 0001h
CLC4SEL3_LC4D4S1_POSN                    equ 0001h
CLC4SEL3_LC4D4S1_POSITION                equ 0001h
CLC4SEL3_LC4D4S1_SIZE                    equ 0001h
CLC4SEL3_LC4D4S1_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S1_MASK                    equ 0002h
CLC4SEL3_LC4D4S2_POSN                    equ 0002h
CLC4SEL3_LC4D4S2_POSITION                equ 0002h
CLC4SEL3_LC4D4S2_SIZE                    equ 0001h
CLC4SEL3_LC4D4S2_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S2_MASK                    equ 0004h
CLC4SEL3_LC4D4S3_POSN                    equ 0003h
CLC4SEL3_LC4D4S3_POSITION                equ 0003h
CLC4SEL3_LC4D4S3_SIZE                    equ 0001h
CLC4SEL3_LC4D4S3_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S3_MASK                    equ 0008h
CLC4SEL3_LC4D4S4_POSN                    equ 0004h
CLC4SEL3_LC4D4S4_POSITION                equ 0004h
CLC4SEL3_LC4D4S4_SIZE                    equ 0001h
CLC4SEL3_LC4D4S4_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S4_MASK                    equ 0010h
CLC4SEL3_LC4D4S5_POSN                    equ 0005h
CLC4SEL3_LC4D4S5_POSITION                equ 0005h
CLC4SEL3_LC4D4S5_SIZE                    equ 0001h
CLC4SEL3_LC4D4S5_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S5_MASK                    equ 0020h
CLC4SEL3_LC4D4S6_POSN                    equ 0006h
CLC4SEL3_LC4D4S6_POSITION                equ 0006h
CLC4SEL3_LC4D4S6_SIZE                    equ 0001h
CLC4SEL3_LC4D4S6_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S6_MASK                    equ 0040h
CLC4SEL3_LC4D4S7_POSN                    equ 0007h
CLC4SEL3_LC4D4S7_POSITION                equ 0007h
CLC4SEL3_LC4D4S7_SIZE                    equ 0001h
CLC4SEL3_LC4D4S7_LENGTH                  equ 0001h
CLC4SEL3_LC4D4S7_MASK                    equ 0080h
CLC4SEL3_LC4D4S_POSN                     equ 0000h
CLC4SEL3_LC4D4S_POSITION                 equ 0000h
CLC4SEL3_LC4D4S_SIZE                     equ 0008h
CLC4SEL3_LC4D4S_LENGTH                   equ 0008h
CLC4SEL3_LC4D4S_MASK                     equ 00FFh
CLC4SEL3_D4S_POSN                        equ 0000h
CLC4SEL3_D4S_POSITION                    equ 0000h
CLC4SEL3_D4S_SIZE                        equ 0008h
CLC4SEL3_D4S_LENGTH                      equ 0008h
CLC4SEL3_D4S_MASK                        equ 00FFh
CLC4SEL3_D4S0_POSN                       equ 0000h
CLC4SEL3_D4S0_POSITION                   equ 0000h
CLC4SEL3_D4S0_SIZE                       equ 0001h
CLC4SEL3_D4S0_LENGTH                     equ 0001h
CLC4SEL3_D4S0_MASK                       equ 0001h
CLC4SEL3_D4S1_POSN                       equ 0001h
CLC4SEL3_D4S1_POSITION                   equ 0001h
CLC4SEL3_D4S1_SIZE                       equ 0001h
CLC4SEL3_D4S1_LENGTH                     equ 0001h
CLC4SEL3_D4S1_MASK                       equ 0002h
CLC4SEL3_D4S2_POSN                       equ 0002h
CLC4SEL3_D4S2_POSITION                   equ 0002h
CLC4SEL3_D4S2_SIZE                       equ 0001h
CLC4SEL3_D4S2_LENGTH                     equ 0001h
CLC4SEL3_D4S2_MASK                       equ 0004h
CLC4SEL3_D4S3_POSN                       equ 0003h
CLC4SEL3_D4S3_POSITION                   equ 0003h
CLC4SEL3_D4S3_SIZE                       equ 0001h
CLC4SEL3_D4S3_LENGTH                     equ 0001h
CLC4SEL3_D4S3_MASK                       equ 0008h
CLC4SEL3_D4S4_POSN                       equ 0004h
CLC4SEL3_D4S4_POSITION                   equ 0004h
CLC4SEL3_D4S4_SIZE                       equ 0001h
CLC4SEL3_D4S4_LENGTH                     equ 0001h
CLC4SEL3_D4S4_MASK                       equ 0010h
CLC4SEL3_D4S5_POSN                       equ 0005h
CLC4SEL3_D4S5_POSITION                   equ 0005h
CLC4SEL3_D4S5_SIZE                       equ 0001h
CLC4SEL3_D4S5_LENGTH                     equ 0001h
CLC4SEL3_D4S5_MASK                       equ 0020h
CLC4SEL3_D4S6_POSN                       equ 0006h
CLC4SEL3_D4S6_POSITION                   equ 0006h
CLC4SEL3_D4S6_SIZE                       equ 0001h
CLC4SEL3_D4S6_LENGTH                     equ 0001h
CLC4SEL3_D4S6_MASK                       equ 0040h
CLC4SEL3_D4S7_POSN                       equ 0007h
CLC4SEL3_D4S7_POSITION                   equ 0007h
CLC4SEL3_D4S7_SIZE                       equ 0001h
CLC4SEL3_D4S7_LENGTH                     equ 0001h
CLC4SEL3_D4S7_MASK                       equ 0080h

